<?php
return [
    
    /* 首选语言包
     * ----------------------------------------
     * 当客户端未指定语言环境时, 默认使用的语言类型
     */
    'pack'              => 'zh-cn',
    
    /* 是否使用客户端语言设定
     * ----------------------------------------
     * 若`false`将会始终使用首选语言包
     */
    'use_client_lang'   => true,
    
    /* 客户端可用的语言包类型
     * ----------------------------------------
     * 该参数代表了客户端可传递的语言类型, 不匹配将
     * 会使用首选语言包.
     * - 需要`use_client_lang`设置为`true`
     */
    'client_lang_allow' => ['zh-cn', 'en-us'],
    
    /* GET 语言设置参数名
     * ----------------------------------------
     * 客户端可通过GET查询参数来设定需要的语言类型
     * - 需要`use_client_lang`设置为`true`
     */
    'lang_get_var'      => 'use_lang',
    
    /* Cookie 语言设置参数名
     * ----------------------------------------
     * 客户端通过cookie保存自己需要的语言环境, 每次
     * 将自动提交该参数.
     * - 需要`use_client_lang`设置为`true`
     */
    'lang_cookie_var'   => 'for_lang',
];